src/cf/DataProcessors/ПостманВ1С.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ПостманВ1С</Name>
			<Comment>ИзвековАА</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьHS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/DataProcessors/ПостманВ1С/Forms/Форма/Ext/Form/Module.bsl
// Структура модуля https://its.1c.ru/db/v8std/content/455/hdoc
//

#Область ОписаниеПеременных
//
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ДобавлятьHS = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьНаСервере()
	
	Объект.ТекстОтвета = "";
	ВремяНачалаВыполнения = ТекущаяДата();
	
	HTTPСоединение = Новый HTTPСоединение(Объект.ИмяСервера,
										  Объект.Порт,
										  Объект.ИмяПользователя,
										  Объект.ПарольПользователя,
										  ,
										  ,
										  ?(Объект.ЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL, Неопределено),
										  Ложь);
	
	ИмяСервисаСБазой = СтрШаблон("%1/%2%3", Объект.ИмяБазы, ?(Объект.ДобавлятьHS, "hs/", ""), Объект.ИмяСервиса);
	HTTPЗапрос = Новый HTTPЗапрос(ИмяСервисаСБазой);
	HTTPЗапрос.УстановитьТелоИзСтроки(Объект.ТекстЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		
	#Область Заголовки
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Accept", "application/json");
	Заголовки.Вставить("Content-Type", "application/json");
	
	HTTPЗапрос.Заголовки = Заголовки;
	
	#КонецОбласти
	
	Попытка
		
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		Объект.ТекстОтвета = СтрШаблон("Код состояния: %1%2%2Текст ответа:%2%3", HTTPОтвет.КодСостояния, Символы.ПС, HTTPОтвет.ПолучитьТелоКакСтроку());
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Объект.ТекстОтвета = СтрШаблон("Текст ошибки:%1%2", Символы.ПС, ТекстОшибки);
		
	КонецПопытки;
	
	ВремяОкончанияВыполнения = ТекущаяДата();
	ДлительностьВыполнения = ВремяОкончанияВыполнения - ВремяНачалаВыполнения;
	
	Разделитель = ?(ПустаяСтрока(Объект.ТекстОтвета), "", Символы.ПС);
	Объект.ТекстОтвета = СтрШаблон("Длительность выполнения: %1%2%3", ДлительностьВыполнения, Разделитель, Объект.ТекстОтвета);
	
КонецПроцедуры

#КонецОбласти
